<a href="https://colab.research.google.com/github/LumyMaral/FECAP-IA/blob/main/Ol%C3%A1%2C_este_%C3%A9_o_Colaboratory.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

<p><img alt="Colaboratory logo" height="45px" src="/img/colab_favicon.ico" align="left" hspace="10px" vspace="0px"></p>

<h1>O que é o Colaboratory?</h1>

O Colaboratory ou "Colab" permite escrever código Python no seu navegador, com: 
- Nenhuma configuração necessária
- Acesso gratuito a GPUs
- Compartilhamento fácil

Você pode ser um <strong>estudante</strong>, um <strong>cientista de dados</strong> ou um <strong>pesquisador de IA</strong>, o Colab pode facilitar seu trabalho. Assista ao vídeo <a href="https://www.youtube.com/watch?v=inN8seMm7UI">Introdução ao Colab</a> para saber mais ou simplesmente comece a usá-lo abaixo!

## <strong>Primeiros passos</strong>

O documento que você está lendo não é uma página da Web estática, mas sim um ambiente interativo chamado <strong>notebook Colab</strong> que permite escrever e executar código.

Por exemplo, aqui está uma <strong>célula de código</strong> com um breve script Python que calcula um valor, armazena-o em uma variável e imprime o resultado:

In [ ]:
seconds_in_a_day = 24 * 60 * 60
seconds_in_a_day

86400

In [3]:
import pandas as pd

In [4]:
dic = {'Nome':['Isa', 'Peter', 'Rico'],
       'Idade':['19', '20', '0'],
       'Salario':['19000', '5000', '100'],
       'Genero':['F', 'M', 'honda civic'],
       'Cargo':['Gerente', 'Supervisor', '']
}

In [5]:
df = pd.DataFrame(dic)
df

    Nome Idade Salario       Genero       Cargo
0    Isa    19   19000            F     Gerente
1  Peter    20    5000            M  Supervisor
2   Rico     0     100  honda civic

In [6]:
print(df)

    Nome Idade Salario       Genero       Cargo
0    Isa    19   19000            F     Gerente
1  Peter    20    5000            M  Supervisor
2   Rico     0     100  honda civic

In [7]:
df.info

<bound method DataFrame.info of     Nome Idade Salario       Genero       Cargo
0    Isa    19   19000            F     Gerente
1  Peter    20    5000            M  Supervisor
2   Rico     0     100  honda civic            >

In [ ]:
df = pd.get_dummies(df,columns=['Genero'])#codigpo ahfjsi

In [15]:
df

    Nome Idade Salario       Cargo  Genero_F  Genero_M  Genero_honda civic
0    Isa    19   19000     Gerente         1         0                   0
1  Peter    20    5000  Supervisor         0         1                   0
2   Rico     0     100                     0         0                   1

In [18]:
df = df.drop(columns=['Cargo'])

In [19]:
df

    Nome Idade Salario  Genero_F  Genero_M  Genero_honda civic
0    Isa    19   19000         1         0                   0
1  Peter    20    5000         0         1                   0
2   Rico     0     100         0         0                   1